# FailureMessageKey Properties

---
The FailureMessageKey type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
FailureMessageKey Class
Autodesk.Revit.DB Namespace